# GetLineWeightChoice

## Description
Get current choice for a line weight dialog control.  The value is in mils.

```pascal
PROCEDURE GetLineWeightChoice(
				dialogID       : LONGINT;
				itemID         : LONGINT;
				VAR lineWeight : INTEGER);
```

```python

def vs.GetLineWeightChoice(dialogID, itemID):
    return lineWeight
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|itemID|LONGINT||
|lineWeight|INTEGER||

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern